### 4 - In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# import splitting and imputing functions
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

# turn off pink boxes for demo
import warnings
warnings.filterwarnings("ignore")

In [2]:
from pydataset import data
df =  data('iris')

#### 4 - a) Print the first 3 rows

In [3]:
df.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

#### 4 - b) Print the number of rows and columns (shape)
 * The Iris dataset has 150 rows and 5 columns

In [4]:
df.shape

(150, 5)

#### 4 - c) Print the  column names
 * The Iris dataset has 150 rows and 5 columns

In [5]:
df.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

#### 4 - d) Print the data type of each column

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [7]:
df.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

#### 4 - e) Print the summary statistics for each of the numeric variables

In [8]:
df.describe().T

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

### 5 Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel

In [9]:
df_excel = pd.read_excel('Excel_Exercises.xlsx')

In [10]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7049 entries, 0 to 7048
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        7049 non-null   object
 1   gender             7049 non-null   object
 2   is_senior_citizen  7049 non-null   int64
 3   partner            7049 non-null   object
 4   dependents         7049 non-null   object
 5   phone_service      7049 non-null   int64
 6   internet_service   7049 non-null   int64
 7   contract_type      7049 non-null   int64
 8   payment_type       7049 non-null   object
 9   monthly_charges    7049 non-null   float64
 10  total_charges      7038 non-null   float64
 11  churn              7049 non-null   object
 12  Unnamed: 12        0 non-null      float64
 13  Unnamed: 13        0 non-null      float64
dtypes: float64(4), int64(4), object(6)
memory usage: 771.1+ KB

##### 5 a) assign the first 100 rows to a new dataframe, df_excel_sample

In [11]:
df_excel.head(3)

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn,Unnamed: 12,Unnamed: 13
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No,NaN,NaN
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No,NaN,NaN
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes,NaN,NaN

In [12]:
df_excel_sample = df_excel.head(100)

##### 5 b) print the number of rows of your original dataframe

In [13]:
df_excel.shape[0]

7049

##### 5 c) print the first 5 column names

In [14]:
five_col = df_excel.columns[:5].to_list()

five_col

['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']

##### 5 d) print the column names that have a data type of object

In [15]:
type_object = df_excel.select_dtypes(include ='object').head()

In [16]:
type_object

  customer_id  gender partner dependents      payment_type churn
0  0002-ORFBO  Female     Yes        Yes      Mailed check    No
1  0003-MKNFE    Male      No         No      Mailed check    No
2  0004-TLHLJ    Male      No         No  Electronic check   Yes
3  0011-IGKFF    Male     Yes         No  Electronic check   Yes
4  0013-EXCHZ  Female     Yes         No      Mailed check   Yes

##### 5 e) compute the range for each of the numeric variables.

In [17]:
variables_ranges = df_excel[['monthly_charges', 'total_charges']].describe().T
variables_ranges

,count,mean,std,min,25%,50%,75%,max
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80

In [18]:
# Meaningful variables to compute the ranges are monthly charges and total charges
variables_ranges['range'] = variables_ranges['max'] - variables_ranges['min']

variables_ranges

,count,mean,std,min,25%,50%,75%,max,range
monthly_charges,7049.0,64.747014,30.099460,18.25,35.4500,70.35,89.850,118.75,100.5
total_charges,7038.0,2283.043883,2266.521984,18.80,401.5875,1397.10,3793.775,8684.80,8666.0

### 6 Read the data from this google sheet into a dataframe, df_google

In [19]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_googlesheet = pd.read_csv(csv_export_url)
# printng the first three rows
df_googlesheet.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

##### 6 b) print the number of rows and columns

In [20]:
df_googlesheet.shape

(891, 12)

##### 6 c) print the column names

In [21]:
df_googlesheet.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

##### 6 d) print the data type of each column

In [22]:
df_googlesheet.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

##### 6 e) print the summary statistics for each of the numeric variables

In [23]:
df_googlesheet.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

##### 6 f) print the unique values for each of your categorical variables
 - Review

In [24]:
df_googlesheet.Survived.value_counts(dropna=False)

0    549
1    342
Name: Survived, dtype: int64

In [25]:
df_googlesheet.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [26]:
df_googlesheet.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64

In [27]:
df_googlesheet.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [28]:
# I could get a count of unique values for each variable with an object data type.

for col in df_googlesheet.columns:
#     print(col)
    if df_googlesheet[col].dtypes == 'object':
        print(f'{col} has {df_googlesheet[col].nunique()} unique values.')

Name has 891 unique values.
Sex has 2 unique values.
Ticket has 681 unique values.
Cabin has 147 unique values.
Embarked has 3 unique values.

## Make a new python module, acquire.py to hold the following data aquisition functions:

### 1 - Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [29]:
import acquire

In [30]:
acquire.get_titanic_data().head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

### 2 -  Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [31]:
acquire.get_iris_data().head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

###  3 - Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join all 4 tables together, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

In [32]:
acquire.get_telco_data().head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,3,0016-QLJIS,Female,0,Yes,Yes,65,Yes,...,Yes,Yes,Yes,Yes,90.45,5957.9,No,Two year,DSL,Mailed check
1,4,1,3,0017-DINOC,Male,0,No,No,54,No,...,Yes,Yes,No,No,45.20,2460.55,No,Two year,DSL,Credit card (automatic)
2,3,1,3,0019-GFNTW,Female,0,No,No,56,No,...,Yes,No,No,No,45.05,2560.1,No,Two year,DSL,Bank transfer (automatic)
3,4,1,3,0056-EPFBG,Male,0,Yes,Yes,20,No,...,Yes,No,No,Yes,39.40,825.4,No,Two year,DSL,Credit card (automatic)
4,3,1,3,0078-XZMHT,Male,0,Yes,No,72,Yes,...,Yes,Yes,Yes,Yes,85.15,6316.2,No,Two year,DSL,Bank transfer (automatic)

## Exercises

## Using the Iris Data:
##### 1 Use the function defined in acquire.py to load the iris data.

In [33]:
df_iris = acquire.get_iris_data()

In [34]:
df_iris.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

##### 2 Drop the species_id and measurement_id columns.

In [35]:
df_iris = df_iris.drop('species_id', axis =1)

In [36]:
df_iris.head()

  species_name  sepal_length  sepal_width  petal_length  petal_width
0       setosa           5.1          3.5           1.4          0.2
1       setosa           4.9          3.0           1.4          0.2
2       setosa           4.7          3.2           1.3          0.2
3       setosa           4.6          3.1           1.5          0.2
4       setosa           5.0          3.6           1.4          0.2

##### 3 Rename the species_name column to just species.

In [37]:
df_iris.rename(columns={'species_name':'species'}, inplace=True)

In [38]:
df_iris.head()

  species  sepal_length  sepal_width  petal_length  petal_width
0  setosa           5.1          3.5           1.4          0.2
1  setosa           4.9          3.0           1.4          0.2
2  setosa           4.7          3.2           1.3          0.2
3  setosa           4.6          3.1           1.5          0.2
4  setosa           5.0          3.6           1.4          0.2

##### 4 Create dummy variables of the species name and concatenate onto the iris dataframe.

In [39]:
#dummy_df = pd.get_dummies(df_iris[['species']], dummy_na=False, drop_first=[True, True])
#dummy_df

In [40]:
dummy_df = pd.get_dummies(df_iris.species)
dummy_df

     setosa  versicolor  virginica
0         1           0          0
1         1           0          0
2         1           0          0
3         1           0          0
4         1           0          0
5         1           0          0
6         1           0          0
7         1           0          0
8         1           0          0
9         1           0          0
10        1           0          0
11        1           0          0
12        1           0          0
13        1           0          0
14        1           0          0
15        1           0          0
16        1           0          0
17        1           0          0
18        1           0          0
19        1           0          0
20        1           0          0
21        1           0          0
22        1           0          0
23        1           0          0
24        1           0          0
25        1           0          0
26        1           0          0
27        1           0          0
28        1           0          0
29        1           0          0
30        1           0          0
31        1           0          0
32        1           0          0
33        1           0          0
34        1           0          0
35        1           0          0
36        1           0          0
37        1           0          0
38        1           0          0
39        1           0          0
40        1           0          0
41        1           0          0
42        1           0          0
43        1           0          0
44        1           0          0
45        1           0          0
46        1           0          0
47        1           0          0
48        1           0          0
49        1           0          0
50        0           1          0
51        0           1          0
52        0           1          0
53        0           1          0
54        0           1          0
55        0           1          0
56        0           1          0
57        0           1          0
58        0           1          0
59        0           1          0
60        0           1          0
61        0           1          0
62        0           1          0
63        0           1          0
64        0           1          0
65        0           1          0
66        0           1          0
67        0           1          0
68        0           1          0
69        0           1          0
70        0           1          0
71        0           1          0
72        0           1          0
73        0           1          0
74        0           1          0
75        0           1          0
76        0           1          0
77        0           1          0
78        0           1          0
79        0           1          0
80        0           1          0
81        0           1          0
82        0           1          0
83        0           1          0
84        0           1          0
85        0           1          0
86        0           1          0
87        0           1          0
88        0           1          0
89        0           1          0
90        0           1          0
91        0           1          0
92        0           1          0
93        0           1          0
94        0           1          0
95        0           1          0
96        0           1          0
97        0           1          0
98        0           1          0
99        0           1          0
100       0           0          1
101       0           0          1
102       0           0          1
103       0           0          1
104       0           0          1
105       0           0          1
106       0           0          1
107       0           0          1
108       0           0          1
109       0           0          1
110       0           0          1
111       0           0          1
112       0           0          1
113       0           0          1
114       0           0          1
115       0           0          1
116       0           0          1
117       0           0          1
118       0           0          1
119       0           0          1
120       0           0          1
121       0           0          1
122       0           0          1
123       0           0          1
124       0           0          1
125       0           0          1
126       0           0          1
127       0           0          1
128       0           0          1
129       0           0          1
130       0           0          1
131       0           0          1
132       0           0          1
133       0           0          1
134       0           0          1
135       0           0          1
136       0           0          1
137       0           0          1
138       0           0          1
139       0           0          1
140       0           0          1
141       0           0          1
142       0           0          1
143       0           0          1
144       0           0          1
145       0           0          1
146       0           0          1
147       0           0          1
148       0           0          1
149       0           0          1

In [41]:
# Concatenate the dummy_df dataframe above with the original df and validate.
df_iris = pd.concat([df_iris, dummy_df], axis=1)
df_iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,setosa,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0

##### 5 Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [42]:
def clean_iris(df):
    '''
    This function acquires the data from source, cleans the data, creates  dummy variables,
    and prepares the data for analysis
    '''
    
    df = df.drop('species_id', axis =1)
    df.rename(columns={'species_name':'species'}, inplace=True)
    #dummy_df = pd.get_dummies(df_iris[['species']], dummy_na=False, drop_first=[True, True])

    dummy_df = pd.get_dummies(df.species)
    df = pd.concat([df, dummy_df], axis=1)
    
    return df

In [45]:
df2 = acquire.get_iris_data()

In [47]:
df2 = clean_iris(df2)

In [49]:
df2.head()

,species,sepal_length,sepal_width,petal_length,petal_width,setosa,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0

In [51]:
df2.shape

(150, 8)

In [52]:
def split_data(df):
    '''
    Takes in a dataframe and return train, validate, test subset dataframes
    '''
    train, test = train_test_split(df, test_size = .2, random_state=123, stratify=df.species)
    train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=train.species)
    return train, validate, test

In [ ]:
train, test = train_test_split(df_iris2, test_size = .2, random_state=123, stratify=df_iris2.species)

In [ ]:
train, validate = train_test_split(train, test_size=.3, random_state=123, stratify=train.species)

In [ ]:
print(f'Train: {train.shape}')
print(f'Validate: {validate.shape}')
print(f'Test: {test.shape}')

In [57]:
def prep_iris(df):
    '''
        This function cleans the data and prepares the data for analysis and testing

    '''
    df = clean_iris(df)
    
    train, validate, test = split_data(df)
     
    return train, validate, test

In [58]:
df = acquire.get_iris_data()

In [59]:
df.head()

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2
3,1,setosa,4.6,3.1,1.5,0.2
4,1,setosa,5.0,3.6,1.4,0.2

In [60]:
df = prep_iris(df)

In [61]:
df

(        species  sepal_length  sepal_width  petal_length  petal_width  setosa  \
 79   versicolor           5.7          2.6           3.5          1.0       0
 36       setosa           5.5          3.5           1.3          0.2       1
 133   virginica           6.3          2.8           5.1          1.5       0
 95   versicolor           5.7          3.0           4.2          1.2       0
 18       setosa           5.7          3.8           1.7          0.3       1
 139   virginica           6.9          3.1           5.4          2.1       0
 20       setosa           5.4          3.4           1.7          0.2       1
 31       setosa           5.4          3.4           1.5          0.4       1
 6        setosa           4.6          3.4           1.4          0.3       1
 115   virginica           6.4          3.2           5.3          2.3       0
 91   versicolor           6.1          3.0           4.6          1.4       0
 145   virginica           6.7          3.0           5.2          2.3       0
 125   virginica           7.2          3.2           6.0          1.8       0
 82   versicolor           5.8          2.7           3.9          1.2       0
 126   virginica           6.2          2.8           4.8          1.8       0
 142   virginica           5.8          2.7           5.1          1.9       0
 15       setosa           5.7          4.4           1.5          0.4       1
 52   versicolor           6.9          3.1           4.9          1.5       0
 4        setosa           5.0          3.6           1.4          0.2       1
 131   virginica           7.9          3.8           6.4          2.0       0
 97   versicolor           6.2          2.9           4.3          1.3       0
 70   versicolor           5.9          3.2           4.8          1.8       0
 51   versicolor           6.4          3.2           4.5          1.5       0
 57   versicolor           4.9          2.4           3.3          1.0       0
 41       setosa           4.5          2.3           1.3          0.3       1
 53   versicolor           5.5          2.3           4.0          1.3       0
 69   versicolor           5.6          2.5           3.9          1.1       0
 23       setosa           5.1          3.3           1.7          0.5       1
 87   versicolor           6.3          2.3           4.4          1.3       0
 3        setosa           4.6          3.1           1.5          0.2       1
 67   versicolor           5.8          2.7           4.1          1.0       0
 35       setosa           5.0          3.2           1.2          0.2       1
 128   virginica           6.4          2.8           5.6          2.1       0
 1        setosa           4.9          3.0           1.4          0.2       1
 16       setosa           5.4          3.9           1.3          0.4       1
 92   versicolor           5.8          2.6           4.0          1.2       0
 32       setosa           5.2          4.1           1.5          0.1       1
 129   virginica           7.2          3.0           5.8          1.6       0
 48       setosa           5.3          3.7           1.5          0.2       1
 25       setosa           5.0          3.0           1.6          0.2       1
 12       setosa           4.8          3.0           1.4          0.1       1
 96   versicolor           5.7          2.9           4.2          1.3       0
 46       setosa           5.1          3.8           1.6          0.2       1
 103   virginica           6.3          2.9           5.6          1.8       0
 89   versicolor           5.5          2.5           4.0          1.3       0
 123   virginica           6.3          2.7           4.9          1.8       0
 120   virginica           6.9          3.2           5.7          2.3       0
 147   virginica           6.5          3.0           5.2          2.0       0
 114   virginica           5.8          2.8           5.1          2.4       0
 83   versicolor           6.0          2.7           5.1          1.6       0
 26       setosa           5.0          3.4           1.6          0.4       1
 84   versicolor           5.4          3.0           4.5          1.5       0
 8        setosa           4.4          2.9           1.4          0.2       1
 24       setosa           4.8          3.4           1.9          0.2       1
 107   virginica           7.3          2.9           6.3          1.8       0
 118   virginica           7.7          2.6           6.9          2.3       0
 112   virginica           6.8          3.0           5.5          2.1       0
 141   virginica           6.9          3.1           5.1          2.3       0
 14       setosa           5.8          4.0           1.2          0.2       1
 43       setosa           5.0          3.5           1.6          0.6       1
 40       setosa           5.0          3.5           1.3          0.3       1
 109   virginica           7.2          3.6           6.1          2.5       0
 74   versicolor           6.4          2.9           4.3          1.3       0
 108   virginica           6.7          2.5           5.8          1.8       0
 119   virginica           6.0          2.2           5.0          1.5       0
 61   versicolor           5.9          3.0           4.2          1.5       0
 81   versicolor           5.5          2.4           3.7          1.0       0
 111   virginica           6.4          2.7           5.3          1.9       0
 58   versicolor           6.6          2.9           4.6          1.3       0
 7        setosa           5.0          3.4           1.5          0.2       1
 149   virginica           5.9          3.0           5.1          1.8       0
 54   versicolor           6.5          2.8           4.6          1.5       0
 94   versicolor           5.6          2.7           4.2          1.3       0
 100   virginica           6.3          3.3           6.0          2.5       0
 137   virginica           6.4          3.1           5.5          1.8       0
 132   virginica           6.4          2.8           5.6          2.2       0
 5        setosa           5.4          3.9           1.7          0.4       1
 88   versicolor           5.6          3.0           4.1          1.3       0
 140   virginica           6.7          3.1           5.6          2.4       0
 11       setosa           4.8          3.4           1.6          0.2       1
 85   versicolor           6.0          3.4           4.5          1.6       0
 55   versicolor           5.7          2.8           4.5          1.3       0
 44       setosa           5.1          3.8           1.9          0.4       1
 73   versicolor           6.1          2.8           4.7          1.2       0

      versicolor  virginica
 79            1          0
 36            0          0
 133           0          1
 95            1          0
 18            0          0
 139           0          1
 20            0          0
 31            0          0
 6             0          0
 115           0          1
 91            1          0
 145           0          1
 125           0          1
 82            1          0
 126           0          1
 142           0          1
 15            0          0
 52            1          0
 4             0          0
 131           0          1
 97            1          0
 70            1          0
 51            1          0
 57            1          0
 41            0          0
 53            1          0
 69            1          0
 23            0          0
 87            1          0
 3             0          0
 67            1          0
 35            0          0
 128           0          1
 1             0          0
 16            0          0
 92            1          0
 32            0          0
 129           0          1
 48            0          0
 25            0          0
 12            0          0
 96            1          0
 46            0          0
 103           0          1
 89            1          0
 123           0          1
 120           0          1
 147           0          1
 114           0          1
 83            1          0
 26            0          0
 84            1          0
 8             0          0
 24            0          0
 107           0          1
 118           0          1
 112           0          1
 141           0          1
 14            0          0
 43            0          0
 40            0          0
 109           0          1
 74            1          0
 108           0          1
 119           0          1
 61            1          0
 81            1          0
 111           0          1
 58            1          0
 7             0          0
 149           0          1
 54            1          0
 94            1          0
 100           0          1
 137           0          1
 132           0          1
 5             0          0
 88            1          0
 140           0          1
 11            0          0
 85            1          0
 55            1          0
 44            0          0
 73            1          0  ,
         species  sepal_length  sepal_width  petal_length  petal_width  setosa  \
 134   virginica           6.1          2.6           5.6          1.4       0
 62   versicolor           6.0          2.2           4.0          1.0       0
 98   versicolor           5.1          2.5           3.0          1.1       0
 66   versicolor           5.6          3.0           4.5          1.5       0
 121   virginica           5.6          2.8           4.9          2.0       0
 59   versicolor           5.2          2.7           3.9          1.4       0
 0        setosa           5.1          3.5           1.4          0.2       1
 37       setosa           4.9          3.6           1.4          0.1       1
 29       setosa           4.7          3.2           1.6          0.2       1
 104   virginica           6.5          3.0           5.8          2.2       0
 10       setosa           5.4          3.7           1.5          0.2       1
 130   virginica           7.4          2.8           6.1          1.9       0
 122   virginica           7.7          2.8           6.7          2.0       0
 9        setosa           4.9          3.1           1.5          0.1       1
 75   versicolor           6.6          3.0           4.4          1.4       0
 39       setosa           5.1          3.4           1.5          0.2       1
 148   virginica           6.2          3.4           5.4          2.3       0
 50   versicolor           7.0          3.2           4.7          1.4       0
 60   versicolor           5.0          2.0           3.5          1.0       0
 71   versicolor           6.1          2.8           4.0          1.3       0
 78   versicolor           6.0          2.9           4.5          1.5       0
 102   virginica           7.1          3.0           5.9          2.1       0
 106   virginica           4.9          2.5           4.5          1.7       0
 64   versicolor           5.6          2.9           3.6          1.3       0
 136   virginica           6.3          3.4           5.6          2.4       0
 90   versicolor           5.5          2.6           4.4          1.2       0
 13       setosa           4.3          3.0           1.1          0.1       1
 49       setosa           5.0          3.3           1.4          0.2       1
 21       setosa           5.1          3.7           1.5          0.4       1
 47       setosa           4.6          3.2           1.4          0.2       1
 143   virginica           6.8          3.2           5.9          2.3       0
 113   virginica           5.7          2.5           5.0          2.0       0
 99   versicolor           5.7          2.8           4.1          1.3       0
 27       setosa           5.2          3.5           1.5          0.2       1
 30       setosa           4.8          3.1           1.6          0.2       1
 124   virginica           6.7          3.3           5.7          2.1       0

      versicolor  virginica
 134           0          1
 62            1          0
 98            1          0
 66            1          0
 121           0          1
 59            1          0
 0             0          0
 37            0          0
 29            0          0
 104           0          1
 10            0          0
 130           0          1
 122           0          1
 9             0          0
 75            1          0
 39            0          0
 148           0          1
 50            1          0
 60            1          0
 71            1          0
 78            1          0
 102           0          1
 106           0          1
 64            1          0
 136           0          1
 90            1          0
 13            0          0
 49            0          0
 21            0          0
 47            0          0
 143           0          1
 113           0          1
 99            1          0
 27            0          0
 30            0          0
 124           0          1  ,
         species  sepal_length  sepal_width  petal_length  petal_width  setosa  \
 80   versicolor           5.5          2.4           3.8          1.1       0
 45       setosa           4.8          3.0           1.4          0.3       1
 144   virginica           6.7          3.3           5.7          2.5       0
 110   virginica           6.5          3.2           5.1          2.0       0
 38       setosa           4.4          3.0           1.3          0.2       1
 2        setosa           4.7          3.2           1.3          0.2       1
 135   virginica           7.7          3.0           6.1          2.3       0
 72   versicolor           6.3          2.5           4.9          1.5       0
 138   virginica           6.0          3.0           4.8          1.8       0
 34       setosa           4.9          3.1           1.5          0.2       1
 19       setosa           5.1          3.8           1.5          0.3       1
 77   versicolor           6.7          3.0           5.0          1.7       0
 101   virginica           5.8          2.7           5.1          1.9       0
 63   versicolor           6.1          2.9           4.7          1.4       0
 117   virginica           7.7          3.8           6.7          2.2       0
 76   versicolor           6.8          2.8           4.8          1.4       0
 42       setosa           4.4          3.2           1.3          0.2       1
 22       setosa           4.6          3.6           1.0          0.2       1
 28       setosa           5.2          3.4           1.4          0.2       1
 33       setosa           5.5          4.2           1.4          0.2       1
 17       setosa           5.1          3.5           1.4          0.3       1
 116   virginica           6.5          3.0           5.5          1.8       0
 127   virginica           6.1          3.0           4.9          1.8       0
 56   versicolor           6.3          3.3           4.7          1.6       0
 105   virginica           7.6          3.0           6.6          2.1       0
 146   virginica           6.3          2.5           5.0          1.9       0
 93   versicolor           5.0          2.3           3.3          1.0       0
 86   versicolor           6.7          3.1           4.7          1.5       0
 68   versicolor           6.2          2.2           4.5          1.5       0
 65   versicolor           6.7          3.1           4.4          1.4       0

      versicolor  virginica
 80            1          0
 45            0          0
 144           0          1
 110           0          1
 38            0          0
 2             0          0
 135           0          1
 72            1          0
 138           0          1
 34            0          0
 19            0          0
 77            1          0
 101           0          1
 63            1          0
 117           0          1
 76            1          0
 42            0          0
 22            0          0
 28            0          0
 33            0          0
 17            0          0
 116           0          1
 127           0          1
 56            1          0
 105           0          1
 146           0          1
 93            1          0
 86            1          0
 68            1          0
 65            1          0  )

## Using the Titanic dataset

#### 1 Use the function defined in acquire.py to load the Titanic data.

In [ ]:
df_titanic = acquire.get_titanic_data()
df_titanic.head()

#### 2 Drop any unnecessary, unhelpful, or duplicated columns.

In [ ]:
# shape of the data
df_titanic.shape

In [ ]:
df_titanic.info()

In [ ]:
# Drop duplicates...run just in case; reassign and check the shape of my data.

df_titanic = df_titanic.drop_duplicates()

In [ ]:
#lets find missing values
missing = df_titanic.isnull().sum()
missing

In [ ]:
# Drop columns...run just in case; reassign and check the shape of my data.
cols_to_drop = ['deck', 'embarked', 'class', 'age']
df_titanic = df_titanic.drop(columns=cols_to_drop)
df_titanic.shape

#### - 3 Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe

We could fill embark_town with most common value, 'Southampton', by hard-coding the value using the fillna() function, as below

In [ ]:
# Run .fillna() on the entire df.
df_titanic['embark_town'] = df_titanic.embark_town.fillna(value='Southampton')

In [ ]:
# Validate that missing values in embark_town have been handled.
df_titanic.embark_town.isna().sum()

Get dummy vars for sex and embark_town

dummy_na: create a dummy var for na values, also? drop_first: drop first dummy var (since we know if they do not belong to any of the vars listed, then they must belong to the first one that is not listed).

In [ ]:
dummy_df = pd.get_dummies(df_titanic[['sex', 'embark_town']], dummy_na=False, drop_first=[True, True])
dummy_df

In [ ]:
# Concatenate the dummy_df dataframe above with the original df and validate.
df_titanic = pd.concat([df_titanic, dummy_df], axis=1)
df_titanic.head()

#### 4 Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [ ]:
def prep_titanic(df):
    '''
    This function acquires the data from source, cleans the data, creates  dummy variables,
    and prepares the data for analysis
    '''
    
    #dropping unwanted columns 
    cols_to_drop = ['deck', 'embarked', 'class', 'age']
    df = df.drop(columns=cols_to_drop)
    # Run .fillna() on the entire df for embark_town with most common value, 'Southampton'.
    df['embark_town'] = df.embark_town.fillna(value='Southampton')
    #Get dummy vars for sex and embark_town
    dummy_df = pd.get_dummies(df[['sex', 'embark_town']], dummy_na=False, drop_first=[True, True])
    # Concatenate the dummy_df dataframe above with the original df and validate.
    df = pd.concat([df, dummy_df], axis=1)
    
    return df

In [ ]:
#acquiring our data from the database or csv
df_titanic2 = acquire.get_titanic_data()

In [ ]:
#let's test if our function works

df_titanic2 = prep_titanic(df_titanic2)

In [ ]:
df_titanic2.head()

## Using the Telco dataset

### 1 Use the function defined in acquire.py to load the Telco data.

In [ ]:
df_telco = acquire.get_telco_data()

In [ ]:
df_telco.head()

#### 2 Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

#### 3 Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.